app/controllers/posts_controller.rb

  def index
    if params[:author_id]
      @posts = Post.select{|post| post.author.id == params[:author_id].to_i}
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')